-- MySQL dump 10.13  Distrib 8.0.28, for Win64 (x86_64)
--
-- Host: localhost    Database: shoping_talor
-- ------------------------------------------------------
-- Server version	8.0.28

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `orders`
--

DROP TABLE IF EXISTS `orders`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `orders` (
  `orderId` int NOT NULL AUTO_INCREMENT,
  `userId` int DEFAULT NULL,
  `inviter` varchar(45) DEFAULT NULL,
  `dateOrder` datetime DEFAULT NULL,
  `totalPrice` double DEFAULT NULL,
  `address` varchar(45) DEFAULT NULL,
  `phoneInviter` varchar(45) DEFAULT NULL,
  `isOrderInWay` tinyint DEFAULT '0',
  `shipmentArrivalDate` datetime DEFAULT NULL,
  PRIMARY KEY (`orderId`),
  KEY `userId_idx` (`userId`),
  CONSTRAINT `userId` FOREIGN KEY (`userId`) REFERENCES `users` (`userId`)
) ENGINE=InnoDB AUTO_INCREMENT=120 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `orders`
--

LOCK TABLES `orders` WRITE;
/*!40000 ALTER TABLE `orders` DISABLE KEYS */;
INSERT INTO `orders` VALUES (21,32,NULL,'2025-02-20 00:00:00',NULL,'בירינבוים 35 בני ברק',NULL,0,NULL),(30,32,NULL,'2025-02-20 00:00:00',NULL,'שדרות רוטשילד 56 עפולה',NULL,0,NULL),(31,32,NULL,'2025-02-20 00:00:00',NULL,'רחוב בלפור 32 ירושלים',NULL,1,NULL),(32,32,NULL,'2025-02-20 00:00:00',NULL,'שדרות רוטשילד 56 עפולה',NULL,0,NULL),(33,32,NULL,'2025-02-23 00:00:00',NULL,'בירינבוים 35 בני ברק',NULL,0,NULL),(34,32,NULL,'2025-02-23 00:00:00',NULL,'בירינבוים 35 בני ברק',NULL,0,NULL),(35,32,NULL,'2025-02-23 00:00:00',NULL,'ירושלים',NULL,0,NULL),(36,32,NULL,'2025-02-23 00:00:00',NULL,'ירושלים',NULL,0,NULL),(37,32,NULL,'2025-02-23 00:00:00',NULL,'ירושלים',NULL,0,NULL),(38,32,NULL,'2025-02-23 00:00:00',NULL,'רחוב בלפור 32 ירושלים',NULL,0,NULL),(39,32,NULL,'2025-03-02 00:00:00',NULL,'שדרות רוטשילד 56 עפולה',NULL,0,NULL),(40,38,NULL,'2025-03-05 00:00:00',NULL,'שדרות רוטשילד 56 עפולה',NULL,0,NULL),(41,49,NULL,'2025-03-05 00:00:00',NULL,'שדרות רוטשילד 56 עפולה',NULL,0,NULL),(42,32,NULL,'2025-03-05 00:00:00',NULL,'שדרות רוטשילד 56 עפולה',NULL,0,NULL),(43,36,NULL,'2025-03-05 00:00:00',NULL,'בירינבוים 35 בני ברק',NULL,0,NULL),(44,36,NULL,'2025-03-05 00:00:00',NULL,'בירינבוים 35 בני ברק',NULL,0,NULL),(45,36,NULL,'2025-03-05 00:00:00',NULL,'רחוב בלפור 32 ירושלים',NULL,0,NULL),(46,32,NULL,'2025-03-11 00:00:00',NULL,'שדרות רוטשילד 56 עפולה',NULL,0,NULL),(47,32,NULL,'2025-03-11 00:00:00',NULL,'שדרות רוטשילד 56 עפולה',NULL,0,NULL),(48,32,NULL,'2025-03-11 00:00:00',NULL,'סג\'עייה',NULL,0,NULL),(49,32,NULL,'2025-03-11 00:00:00',2045,'שדרות רוטשילד 56 עפולה',NULL,0,NULL),(50,32,NULL,'2025-03-18 00:00:00',120,'נחליאל 78',NULL,0,NULL),(51,32,NULL,'2025-03-18 00:00:00',500,'נחליאל',NULL,0,NULL),(52,32,'undefined','2025-03-18 00:00:00',124,'נחליאל','undefined',0,NULL),(53,32,'null null','2025-03-18 00:00:00',80,'נחליאל','0555454652',0,NULL),(54,32,'ddddddddddddd','2025-03-18 00:00:00',45,'sgf','rgtr',0,'2025-03-25 00:00:00'),(55,32,'ffffffffffffffff','2025-03-18 18:25:37',45,'sgf','rgtr',0,'2025-03-25 18:25:37'),(56,32,'aaaa bbbb','2025-03-18 19:14:55',960,'נחליאל','0555454652',0,NULL),(57,32,'טל דבורה שושן','2025-03-18 23:44:28',1880,'נתיבות דרכי רפאל 8 קומה ראשונה','0545792303',0,NULL),(58,32,'טל דבורה שושן','2025-03-19 18:49:18',1000,'נחליאל 78','0555454652',0,NULL),(59,32,'טל דבורה שושן','2025-03-19 18:51:44',440,'נחליאל 78','0555454652',0,NULL),(60,32,'טל דבורה שושן','2025-03-19 19:13:31',440,'נחליאל 78','0555454652',0,'2025-03-26 19:13:31'),(61,32,'טל דבורה שושן','2025-03-19 19:17:55',20,'נחליאל','0555454652',0,'2025-03-26 19:17:55'),(62,32,'ffffffffffffffff','2025-03-19 21:07:25',45,'sgf','rgtr',0,'2025-03-26 21:07:25'),(63,32,'טל דבורה שושן','2025-03-19 22:27:50',100,'נחליאל','0555454652',0,'2025-03-26 22:27:50'),(64,32,'טל דבורה שושן','2025-03-19 22:29:30',20,'נחליאל נופך 7','0555454652',0,'2025-03-26 22:29:30'),(65,32,'טל דבורה שושן','2025-03-19 23:11:55',20,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:11:55'),(66,32,'טל דבורה שושן','2025-03-19 23:12:20',20,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:12:20'),(67,32,'טל דבורה שושן','2025-03-19 23:14:17',0,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:14:17'),(68,32,'טל דבורה שושן','2025-03-19 23:14:32',20,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:14:32'),(69,32,'טל דבורה שושן','2025-03-19 23:15:16',430,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:15:16'),(70,32,'טל דבורה שושן','2025-03-19 23:15:55',430,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:15:55'),(71,32,'טל דבורה שושן','2025-03-19 23:16:18',20,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:16:18'),(72,32,'טל דבורה שושן','2025-03-19 23:16:58',20,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:16:58'),(73,32,'טל דבורה שושן','2025-03-19 23:22:59',80,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:22:59'),(74,32,'טל דבורה שושן','2025-03-19 23:34:04',160,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:34:04'),(75,32,'טל דבורה שושן','2025-03-19 23:36:32',860,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:36:32'),(76,32,'טל דבורה שושן','2025-03-19 23:39:00',430,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:39:00'),(77,32,'טל דבורה שושן','2025-03-19 23:39:28',20,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:39:28'),(78,32,'טל דבורה שושן','2025-03-19 23:41:00',20,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:41:00'),(79,32,'טל דבורה שושן','2025-03-19 23:44:07',430,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:44:07'),(80,32,'טל דבורה שושן','2025-03-19 23:59:45',430,'נחליאל נופך 7','0555454652',0,'2025-03-26 23:59:45'),(81,32,'טל דבורה שושן','2025-03-20 00:00:41',430,'נחליאל נופך 7','0555454652',0,'2025-03-27 00:00:41'),(82,32,'טל דבורה שושן','2025-03-20 17:55:27',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 17:55:27'),(83,32,'טל דבורה שושן','2025-03-20 17:55:34',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 17:55:34'),(84,32,'טל דבורה שושן','2025-03-20 17:56:02',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 17:56:02'),(85,32,'טל דבורה שושן','2025-03-20 18:06:14',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:06:14'),(86,32,'טל דבורה שושן','2025-03-20 18:06:16',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:06:16'),(87,32,'טל דבורה שושן','2025-03-20 18:06:16',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:06:16'),(88,32,'טל דבורה שושן','2025-03-20 18:06:16',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:06:16'),(89,32,'טל דבורה שושן','2025-03-20 18:06:16',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:06:16'),(90,32,'טל דבורה שושן','2025-03-20 18:12:18',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:12:18'),(91,32,'טל דבורה שושן','2025-03-20 18:12:38',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:12:38'),(92,32,'טל דבורה שושן','2025-03-20 18:13:09',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:13:09'),(93,32,'טל דבורה שושן','2025-03-20 18:13:28',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:13:28'),(94,32,'טל דבורה שושן','2025-03-20 18:17:16',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:17:16'),(95,32,'טל דבורה שושן','2025-03-20 18:17:57',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:17:57'),(96,32,'טל דבורה שושן','2025-03-20 18:19:10',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:19:10'),(97,32,'טל דבורה שושן','2025-03-20 18:19:54',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:19:54'),(98,32,'טל דבורה שושן','2025-03-20 18:19:56',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:19:56'),(99,32,'טל דבורה שושן','2025-03-20 18:19:56',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:19:56'),(100,32,'טל דבורה שושן','2025-03-20 18:19:56',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:19:56'),(101,32,'טל דבורה שושן','2025-03-20 18:26:22',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:26:22'),(102,32,'טל דבורה שושן','2025-03-20 18:27:53',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:27:53'),(103,32,'טל דבורה שושן','2025-03-20 18:27:54',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:27:54'),(104,32,'טל דבורה שושן','2025-03-20 18:27:54',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:27:54'),(105,32,'טל דבורה שושן','2025-03-20 18:28:09',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:28:09'),(106,32,'טל דבורה שושן','2025-03-20 18:31:56',140,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:31:56'),(107,32,'טל דבורה שושן','2025-03-20 18:32:28',570,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:32:28'),(108,32,'טל דבורה שושן','2025-03-20 18:33:07',20,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:33:07'),(109,32,'טל דבורה שושן','2025-03-20 18:36:04',20,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:36:04'),(110,32,'טל דבורה שושן','2025-03-20 18:36:15',20,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:36:15'),(111,32,'טל דבורה שושן','2025-03-20 18:42:25',20,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:42:25'),(112,32,'טל דבורה שושן','2025-03-20 18:46:00',20,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:46:00'),(113,32,'טל דבורה שושן','2025-03-20 18:46:05',20,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:46:05'),(114,32,'טל דבורה שושן','2025-03-20 18:46:31',20,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:46:31'),(115,32,'טל דבורה שושן','2025-03-20 18:46:38',20,'נחליאל נופך 7','0555454652',0,'2025-03-27 18:46:38'),(116,32,'טל דבורה שושן','2025-03-20 18:55:21',430,'בירינבוים','0555454652',0,'2025-03-27 18:55:21'),(117,32,'סיון בוכריץ','2025-03-20 19:07:46',100,'נחליאל נופך 7','0555454652',0,'2025-03-27 19:07:46'),(118,32,'טל דבורה שושן','2025-03-27 12:42:19',130,'נחליאל נופך 7','0555454652',0,'2025-04-03 12:42:19'),(119,32,'טל דבור bhj שושן','2025-03-27 12:46:03',60,'נחליאל נופך 7','0555454652',0,'2025-04-03 12:46:03');
/*!40000 ALTER TABLE `orders` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2025-03-27 13:09:57
